# ── Core development tools ─────────────────────────────────────────
brew "git"
brew "neovim"
brew "ripgrep"
brew "fd"
brew "bat"
brew "fzf"
brew "eza"
brew "tree-sitter"
brew "jq"
brew "lazygit"
brew "lazydocker"
brew "zoxide"
brew "yazi"
brew "stow"

# ── Shell plugins ──────────────────────────────────────────────────
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-completions"

# ── Terminal ───────────────────────────────────────────────────────
cask "wezterm"

# ── AI tools ───────────────────────────────────────────────────────
brew "opencode"

# ── Language runtimes ──────────────────────────────────────────────
brew "nvm"
brew "ruby"

# ── Window management and UI ──────────────────────────────────────
cask "nikitabobko/tap/aerospace"
tap  "FelixKratz/formulae"
brew "borders"
cask "ubersicht"

# ── Container tools ────────────────────────────────────────────────
brew "podman"

# ── Fonts ──────────────────────────────────────────────────────────
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
cask "sf-symbols"

# ── Optional (uncomment if needed) ─────────────────────────────────
# cask "docker"
# brew "bitwarden-cli"
